{
  "pools": [
    {
      "rolls": 1,
      "entries": [
        {
          "type": "item",
          "name": "minecraft:written_book",
          "functions": [
            {
              "function": "set_name",

              "name": "§r§6Minister Guide"
            },
            {
              "function": "set_book_contents",

              "title": "§6Minister Guide",
              "author": "thump989",

              "pages": [
                "This Guidebook contains information on all of the Ministers, orderd Fire, Water, Air, Earth",
                "It is recommended to reach the Ministers before reading this book. You have been warned",
                "§2Fire Minister(Phase 1 Behaviour)§r\nThis firey behemoth fights just like a normal Blaze, shooting volleys of fireballs, and using melee attacks on anyone who gets too close. Just like normal Blazes, it is vulnerable to water",
                "§2Fire Minister(Phase Two Behaviour)§r\nOnce the Fire Minister reaches 150 health, it will explode in a firey rage, burning the ground and boiling away nearby water and rain. It now swaps between summoning Fire Sprite Minions, and using melee/ranged attacks",
                "§2Cont.§r\nIt burns so hot, it no longer takes damage from water, sets the ground and all mobs near it on fire, and continues to burn away water. Fire Resistance is a must for this phase",
                "§2Fire Minister(Phase 1 Stats)§r\nHealth: 300\nAttack(Melee): 7, causes a five block wide fire explosion that deals 7 damage and ignites for 10 seconds\nAttack(Ranged): Explosive fireball that deals 13 damage on a direct hit\nArmour: 15",
                "§2Fire Minister(Phase 2 Stats)§r\nAttack(Melee): 7, causes a five block wide fire explosion that deals 7 damage and ignites for 10 seconds\nSummons 6 Fire Sprites. They have 10 health and deal 4 damage with their melee attack",
                "§2Water Minister(Phase 1 Behaviour)§r\nThe Water Minister will not fight on land, and will flee if it is ever outside water. It also makes nearby air dangerous to breath, forcing players underwater",
                "§2Cont.§r\nFights just like a normal Brine, but with larger bubble sprays and stronger homing bubbles",
                "§2Water Minister(Phase 2 Behaviour)§r\nUpon reaching 150 health, the Water Minister begins to swim around the player erratically. It will occasionally stop to spawn a Brine, and constantly unleashes homing bubbles as it swims",
                "§2Water Minister(Phase 1 Stats)§r\nHealth: 300\nAttack(Bubble Burst): 7\nAttack(Homing Bubble): 12, takes three hits to destroy\nArmour: 15",
                "§2Water Minister(Phase 2 Stats)§r\nSpawns a Brine every 15 seconds, and releases a Homing Bubble every 4 seconds\n§8To prevent softlocking due to the breathing air damage, the Water Minister will despawn if all players leave the world",
                "§2Air Minister(Phase 1 Behaviour)§r\nThe Air Minister calls down lightning strikes on all nearby players, and summons Breezes to fight alongside it. Otherwise fights just like a normal Breeze",
                "§2Air Minister(Phase 2 Behavior)§r\nUpon reaching 150 health, the Air Minister summons a thunderstorm, and its lightning strikes get more frequent. Will now shoot a homing tornado, and it jumps around far more often",
                "§2Air Minister(Phase 1 Stats)§r\nAttack: 1\nLightning Attack: Summons lightningbolts on all players every 10 seconds\nSummons 3 Breezes. This summon attack can be used every 45 seconds",
                "§2Air Minister(Phase 2 Stats)§r\nAttack(Wind Charge): 1\nAttack(Tornado): 14\nLightning Attack: Summons lightningbolts on all players every 7 seconds\nArmour: 15",
                "§2Earth Minister(Phase 1 Behaviour)§r\nWill use melee attacks on players close to it, and will summon Blemish. Otherwise shoots out blocks that place themselves on contact with the ground",
                "§2Earth Minister(Phase 2 Behaviour)§r\nUpon reachig 150 health, the Earth Minister will burrow into the ground and become invulnerable. While underground, it will release four high damage quakes before resurfacing.",
                "§2Cont.§r\nOnce it resurfaces, it will use enhanced versions of Phase 1 attack, dealing more melee damage and shooting blocks faster. Also afflicts all nearby players with Mining Fatiuge",
                "§2Earth Minister(Phase 1 Stats)§r\nAttack(Melee): 12\nAttack(Block Shot):6-14; damage varies based on the block type\nArmour: 15",
                "§2Earth Minister(Phase 1 Stats)§r\nAttack(Melee): 14\nAttack(Block Shot):6-14; damage varies based on the block type\nQuake Attack: 18",
                "§4Warning!§r\nThe next section contains info on the Astral Minister. It is recommended to reach it before reading this section. You have been warned",
                "§2Spawning the Astral Minister§r\nBuild the Reactor Structure as follows, from bottom to top: §8The Red Signs represent air\n\n\n\n\n\n",
                "\n\n\n\n\n\n\n\n\n\n\n",
                "§2Astral Minister Behaviour§r\nThe Astral Minister creates an arena upon being summoned, and does not move. It will randomly select between firing radioactive stars at players, creating massive starstorms, making black holes, and summoning Astral Coral",
                "§2Astral Minister(Stats):§r\nHealth: 800\n\nArmour: 15",
                "§2Radioactive Star§r\nThe Star only deals 5 damage on hit, but inflicts Poison for 30 seconds. They explode into a burst of smaller radioactive stars on hit",
                "§2Starstorm§r\nThe Astral Minister opens a tear in space, and rains a huge amount of stars over the whole arena. These stars deal a massive 25 damage on hit, and inflict weakness for 20 seconds",
                "§2Black Hole§r\nThe Astral Minister creates a mini Black Hole at a random point in the arena. It pulls all players towards it, with the suction effect being stronger the further you are from it. Deals immense damage if you touch it",
                "§2Astral Coral§r\nSpawns 8 Astral Coral at random positions inside the arena. They have 20 health, deal 9 melee damage while inflicting Slowness for 10 seconds, and heal the Astral Minster for 8 health every 8 seconds"
              ]
            }
          ]
        }
      ]
    },
    {
      "rolls": 1,
      "entries": [
        {
          "type": "item",
          "name": "minecraft:written_book",
          "functions": [
            {
              "function": "set_name",

              "name": "§r§6Caldpteron Guide"
            },
            {
              "function": "set_book_contents",

              "title": "§6Minister Guide",
              "author": "thump989",

              "pages": [
                "This Guidebook contains information on the Caldpteron, the boss atop the Bug Tower",
                "It is recommended to reach the Caldpteron before reading this book. You have been warned",
                "§2Caldpteron(Overview)§r\nThe mighty Caldpteron can be summoned by interacting with the egg atop the Bug Tower. The Egg can summon another Caldpteron once 15 minutes has passed",
                "The Caldpteron alternates between flying and being grounded\nHealth: 3,000\nArmour: 10",
                "§2Icicle Shot§r\nWhile flying, the Caldpteron may fire a barrage of highly accurate icicles. They deal 14 damage each, and cause Slowness 3 for 10 seconds",
                "§2Ice Spike(Flying)§r\nWhile flying, the Caldpteron may summon a few icecubes around the player, then send a line of recursive Ice Spikes at them. The Ice Spikes deal 13 Freezing damage\n§8Freezing damage type is identical to magic",
                "§2Ice Trap§r\nWhile flying or grounded, the Caldpteron may summon a circle of Ice Cubes around the player, then fill the inside with Ice Spikes\nThe Ice Cubes have 35 health, but take 4x damage from fire",
                "§2Melee Attack§r\nWhile on the ground and between Ice attacks, the Caldpteron will use melee attacks. They deal 16 damage, and inflict Slowness for 10 seconds",
                "§2Ice Veil§r\nWhile on the ground, the Caldpteron may summon an aura of frost around itself, dealing 9 Freezing damage every 1.5 seconds to anyone within the aura. Also heals any Ice Cubes inside",
                "§2Ice Spike(Ground)§r\nWhile on the ground, the Caldpteron may summon two rings of Ice Spikes. One is centered on itself, and the other is centered on its target",
                "§2Roar§r\nWhile on the ground, the Caldpteron may unleash a powerful roar attack. It deals 15 damage, and causes all Ice Cubes to turn red. Red Ice Cubes will explode, dealing 12 Freezing damage"
              ]
            }
          ]
        }
      ]
    },
    {
      "rolls": 1,
      "entries": [
        {
          "type": "item",
          "name": "minecraft:written_book",
          "functions": [
            {
              "function": "set_name",

              "name": "§r§6Phantore Guide"
            },
            {
              "function": "set_book_contents",

              "title": "§6Minister Guide",
              "author": "thump989",

              "pages": [
                "This Guidebook contains information on Phantore, the boss within the Graveyard",
                "It is recommended to reach Phantore before reading this book. You have been warned",
                "§2Phantore(Phase 1 Behaviour)§r\nPhantore, Lord and Master of the Undead uses powerful magic and summoning attacks. While alive, the world is set to night. Permanently\nHealth: 3000\nArmour: 10",
                "He can call up grasping hands from the underworld, which follow players and deal massive Magic damage on contact. He will also summon Mystic Zombies and Sinister Witches, and create massive rings of Shadowflame",
                "After performing a few attacks, Phantore will use one of his special attacks. He will either summon the powerful Elite Skeletons, or absorb the exp of all nearby players, using the energy to release a massive magical blast",
                "§2Phantore(Phase 2 Behaviour)§r\nPhantore will occasionally chase down his target, using melee attacks that inflict permanent Trial Omen. He will also release a surge of Sinister Blasts",
                "He will still summon Shadowfire, but in a much smaller ring. He also keeps the two special attacks",
                "§2Phantore(Phase 3 Behaviour)§r\nPhantore returns to using summoning attacks, performing them much faster than in Phase 1. Instead of a ring of Shadowfire, he will create a line that lasts much longer",
                "He will also summon Metalsnare Piglins instead of Sinister Witches. He keeps the Sinister Blast attack from Phase 2, now shooting even more blasts, and shooting them farther. Underworld Hands linger for far longer",
                "§2Phase 1 Stats§r\nHealth: 3,000\nArmour: 10\nUnderworld Hands Attack: 11 Magic\nElite Skeletons: §8Melee Elite Skeleton armour is enchanted with Protection 4, and their Swords have Fire Aspect 2",
                "§8Elite Skeletons Cont.\nRanged Elite Skeleton's armour is unenchanted, but their Bows have Power 5, Flame, and Punch 1, as well as firing Instant Harming 2 arrows",
                "§2EXP Blast Attack§r\nPhantore will absorb all exp on the ground, as well as siphon it off nearby players. The more experience he absorbs, the bigger and more damaging the resulting explosion will be. The explosion deals Magic damage",
                "§2Phase 2 Stats§r\nHealth: 4,000\nRoar Attack: 15\nArmour: 10",
                "§2Phase 3 Stats§r\nHealth: 3,000\nArmour: 10"
              ]
            }
          ]
        }
      ]
    }
  ]
}
